frank26080115/robots/Roach/libraries/nRF52RawRadio/RadioHead.h
- ESP32 built using Arduino IDE 1.8.9 or later using the ESP32 toolchain installed per
  https://github.com/espressif/arduino-esp32
  The internal 2.4GHz radio is not yet supported. Tested with RFM22 using SPI interface.
  Uses the VSPI SPI bus by default.
  You can enable use of the alternative HSPI bus for SPI by defining RH_ESP32_USE_HSPI in RadioHead.h.

- Raspberry Pi
  Uses BCM2835 library for GPIO http://www.airspayce.com/mikem/bcm2835/
  Currently works only with RH_NRF24 driver or other drivers that do not require interrupt support.
  Contributed by Mike Poublon.

- Linux and OSX
  Using the RHutil/HardwareSerial class, the RH_Serial driver and any manager will
  build and run on Linux and OSX. These can be used to build programs that talk securely and reliably to
  Arduino and other processors or to other Linux or OSX hosts on a reliable, error detected (and possibly encrypted) datagram
  protocol over various types of serial line.

- Mongoose OS, courtesy Paul Austen. Mongoose OSis an Internet of Things Firmware Development Framework
  available under Apache License Version 2.0. It supports low power, connected microcontrollers such as:
  ESP32, ESP8266, TI CC3200, TI CC3220, STM32.
  https://mongoose-os.com/

- muRata cmwx1zzabz module, which includes an STM32L0 processor,
  a SX1276 LoRa radio and an antenna switch.

- Raspberry Pi Pico, on Arduino, using either the Raspberry Pi Pico/RP2040 core by Earle F. Philhower, version 1.93,
  installed per https://arduino-pico.readthedocs.io/_/downloads/en/latest/pdf/
  or the alternative Arduino MBED OS RP2040 core version 2.4.1. At this stage support is partial: RH_ASK works
  but radio drivers that use interrupts do not (yet) work in either core.

Other platforms are partially supported, such as Generic AVR 8 bit processors, MSP430.
We welcome contributions that will expand the range of supported platforms.

If your processor is not on the list above, there is a good chance it
wont work without modifying RadioHead to suit it.  If you wish for
support for another processor, and you send 2 of them to
AirSpayce Pty Ltd, we will consider adding support for it.

RadioHead is available (through the efforts of others)
for PlatformIO. PlatformIO is a cross-platform code builder and the missing library manager.
http://platformio.org/#!/lib/show/124/RadioHead

\par History

RadioHead was created in April 2014, substantially based on code from some of our other earlier Radio libraries:

- RHMesh, RHRouter, RHReliableDatagram and RHDatagram are derived from the RF22 library version 1.39.
- RH_RF22 is derived from the RF22 library version 1.39.
- RH_RF69 is derived from the RF69 library version 1.2.
- RH_ASK is based on the VirtualWire library version 1.26, after significant conversion to C++.
- RH_Serial was new.
- RH_NRF24 is based on the NRF24 library version 1.12, with some significant changes.

During this combination and redevelopment, we have tried to retain all the processor dependencies and support from
the libraries that were contributed by other people. However not all platforms can be tested by us, so if you
find that support from some platform has not been successfully migrated, please feel free to fix it and send us a
patch.

Users of RHMesh, RHRouter, RHReliableDatagram and RHDatagram in the previous RF22 library will find that their
existing code will run mostly without modification. See the RH_RF22 documentation for more details.

\par Installation

For Arduino IDE, install in the usual way: unzip the distribution zip file to the libraries
sub-folder of your sketchbook.
The example sketches will be visible in in your Arduino, mpide, maple-ide or whatever.
http://arduino.cc/en/Guide/Libraries

\par Building for Particle Photon

The Photon is not supported by the Arduino IDE, so it takes a little effort to set up a build environment.
Heres what we did to enable building of RadioHead example sketches on Linux,
but there are other ways to skin this cat.
Basic reference for getting started is: http://particle-firmware.readthedocs.org/en/develop/build/
- Download the ARM gcc cross compiler binaries and unpack it in a suitable place:
\code
cd /tmp
wget https://launchpad.net/gcc-arm-embedded/5.0/5-2015-q4-major/+download/gcc-arm-none-eabi-5_2-2015q4-20151219-linux.tar.bz2
tar xvf gcc-arm-none-eabi-5_2-2015q4-20151219-linux.tar.bz2
\endcode
- If dfu-util and friends not installed on your platform, download dfu-util and friends to somewhere in your path
\code
cd ~/bin
wget http://dfu-util.sourceforge.net/releases/dfu-util-0.8-binaries/linux-i386/dfu-util
wget http://dfu-util.sourceforge.net/releases/dfu-util-0.8-binaries/linux-i386/dfu-suffix
wget http://dfu-util.sourceforge.net/releases/dfu-util-0.8-binaries/linux-i386/dfu-prefix
\endcode
- Download the Particle firmware (contains headers and libraries require to compile Photon sketches)
  to a suitable place:
\code
cd /tmp
wget https://github.com/spark/firmware/archive/develop.zip
unzip develop.zip
\endcode
- Make a working area containing the RadioHead library source code and your RadioHead sketch. You must
  rename the sketch from .pde or .ino to application.cpp
\code
cd /tmp
mkdir RadioHead
cd RadioHead
cp /usr/local/projects/arduino/libraries/RadioHead/ *.h .
cp /usr/local/projects/arduino/libraries/RadioHead/ *.cpp .
cp /usr/local/projects/arduino/libraries/RadioHead/examples/cc110/cc110_client/cc110_client.pde application.cpp
\endcode
- Edit application.cpp and comment out any \#include <SPI.h> so it looks like:
\code
  // #include <SPI.h>
\endcode
- Connect your Photon by USB. Put it in DFU mode as descibed in Photon documentation. Light should be flashing yellow
- Compile the RadioHead sketch and install it as the user program (this does not update the rest of the
  Photon firmware, just the user part:
\code
cd /tmp/firmware-develop/main
PATH=$PATH:/tmp/gcc-arm-none-eabi-5_2-2015q4/bin make APPDIR=/tmp/RadioHead all PLATFORM=photon program-dfu
\endcode
- You should see RadioHead compile without errors and download the finished sketch into the Photon.

