frank26080115/robots/Roach/libraries/nRF52RawRadio/RadioHead.h
             RHMesh, RHRouter and RHReliableDatagram updated so they can use RH_Serial without
             polling loops on Linux and OSX for CPU efficiency.<br>
 \version 1.46 2015-08-14
             Amplified some doc concerning Linux and OSX RH_Serial. Added support for 230400
             baud rate in HardwareSerial.<br>
             Added sample sketches nrf51_audio_tx and nrf51_audio_rx which show how to
             build an audio TX/RX pair with RedBear nRF51822 boards and a SparkFun MCP4725 DAC board.
             Uses the built-in ADC of the nRF51822 to sample audio at 5kHz and transmit packets
             to the receiver which plays them via the DAC.<br>
\version 1.47 2015-09-18
             Removed top level Makefile from distribution: its only used by the developer and
             its presence confuses some people.<br>
             Fixed a problem with RHReliableDatagram with some versions of Raspberry Pi random() that causes
             problems: random(min, max) sometimes exceeds its max limit.
\version 1.48 2015-09-30
             Added support for Arduino Zero. Tested on Arduino Zero Pro.
\version 1.49 2015-10-01
             Fixed problems that prevented interrupts working correctly on Arduino Zero and Due.
             Builds and runs with 1.6.5 (with 'Arduino SAMD Boards' for Zero version 1.6.1) from arduino.cc.
             Arduino version 1.7.7 from arduino.org is not currently supported.
\version 1.50 2015-10-25
             Verified correct building and operation with Arduino 1.7.7 from arduino.org.
             Caution: You must burn the bootloader from 1.7.7 to the Arduino Zero before it will
             work with Arduino 1.7.7 from arduino.org. Conversely, you must burn the bootloader from 1.6.5
             to the Arduino Zero before it will
             work with Arduino 1.6.5 from arduino.cc. Sigh.
             Fixed a problem with RH_NRF905 that prevented the power and frequency ranges being set
             properly. Reported by Alan Webber.
\version 1.51 2015-12-11
             Changes to RH_RF6::setTxPower() to be compatible with SX1276/77/78/79 modules that
             use RFO transmitter pins instead of PA_BOOST, such as the excellent
             Modtronix inAir4 http://modtronix.com/inair4.html
             and inAir9 modules http://modtronix.com/inair9.html. With the kind assistance of
             David from Modtronix.
\version 1.52 2015-12-17
             Added RH_MRF89 module to suport Microchip MRF89XA and compatible transceivers.
             and modules.<br>
\version 1.53 2016-01-02
             Added RH_CC110 module to support Texas Instruments CC110L and compatible transceivers and modules.<br>
\version 1.54 2016-01-29
             Added support for ESP8266 processor on Arduino IDE. Examples serial_reliable_datagram_* are shown to work.
             CAUTION: SPI not supported yet. Timers used by RH_ASK are not tested.
             The GHz radio included in the ESP8266 is not yet supported.
\version 1.55 2016-02-12
             Added macros for htons() and friends to RadioHead.h.
             Added example sketch serial_gateway.pde. Acts as a transparent gateway between RH_RF22 and RH_Serial,
             and with minor mods acts as a universal gateway between any 2 RadioHead driver networks.
             Initial work on supporting STM32 F2 on Particle Photon: new platform type defined.
             Fixed many warnings exposed by test building for Photon.
             Particle Photon tested support for RH_Serial, RH_ASK, SPI, RH_CC110 etc.
             Added notes on how to build RadioHead sketches for Photon.
\version 1.56 2016-02-18
             Implemented timers for RH_ASK on ESP8266, added some doc on IO pin selection.
\version 1.57 2016-02-23
             Fixed an issue reported by S3B, where RH_RF22 would sometimes not clear the rxbufvalid flag.
\version 1.58 2-16-04-04
             Tested RH_RF69 with Arduino Due. OK. Updated doc.<br>
             Added support for all ChipKIT Core supported boards
             http://chipkit.net/wiki/index.php?title=ChipKIT_core
             Tested on ChipKIT Uno32.<br>
             Digilent Uno32 under the old MPIDE is no longer formally
             supported but may continue to work for some time.<br>
\version 1.59 2016-04-12
             Testing with the excellent Rocket Scream Mini Ultra Pro with the RFM95W and RFM69HCW modules from
             http://www.rocketscream.com/blog/product/mini-ultra-pro-with-radio/  (915MHz versions). Updated
             documentation with hints to suit. Caution: requires Arduino 1.6.8 and Arduino SAMD Boards 1.6.5.
             See also http://www.rocketscream.com/blog/2016/03/10/radio-range-test-with-rfm69hcw/
             for the vendors tests and range with the RFM69HCW version. They also have an RF95 version equipped with
             TCXO temperature controllled oscillator for extra frequency stability and support of very slow and
             long range protocols.
             These boards are highly recommended. They also include battery charging support.
\version 1.60 2016-06-25
             Tested with the excellent talk2 Whisper Node boards
            (https://talk2.wisen.com.au/ and https://bitbucket.org/talk2/),
             an Arduino Nano compatible board, which include an on-board RF69 radio, external antenna,
             run on 2xAA batteries and support low power operations. RF69 examples work without modification.
             Added support for ESP8266 SPI, provided by David Skinner.
\version 1.61 2016-07-07
             Patch to RH_ASK.cpp for ESP8266, to prevent crashes in interrupt handlers. Patch from Alexander Mamchits.
\version 1.62 2016-08-17
             Fixed a problem in RH_ASK where _rxInverted was not properly initialised. Reported by "gno.sun.sop".
             Added support for  waitCAD() and isChannelActive() and setCADTimeout() to RHGeneric.
             Implementation of RH_RF95::isChannelActive() allows the RF95 module to support
             Channel Activity Detection (CAD). Based on code contributed by Bent Guldbjerg Christensen.
             Implmentations of isChannelActive() plus documentation for other radio modules wil be welcomed.
\version 1.63 2016-10-20
             Testing with Adafruit Feather 32u4 with RFM69HCW. Updated documentation to reflect.<br>
\version 1.64 2016-12-10
             RHReliableDatagram now initialises _seenids. Fix from Ben Lim.<br>
             In RH_NRF51, added get_temperature().<br>
             In RH_NRF51, added support for AES packet encryption, which required a slight change
             to the on-air message format.<br>
\version 1.65 2017-01-11
             Fixed a race condition with RH_NRF51 that prevented ACKs being reliably received.<br>
             Removed code in RH_NRF51 that enabled the DC-DC converter. This seems not to be a necessary condition
             for the radio to work and is now left to the application if that is required.<br>
             Proven interoperation between nRF51822 and nRF52832.<br>
             Modification and testing of RH_NRF51 so it works with nRF52 family processors,
             such Sparkfun nRF52832 breakout board, with Arduino 1.6.13 and
             Sparkfun nRF52 boards manager 0.2.3 using the procedures outlined in
             https://learn.sparkfun.com/tutorials/nrf52832-breakout-board-hookup-guide<br>
             Caution, the Sparkfun development system for Arduino is still immature. We had to
             rebuild the nrfutil program since the supplied one was not suitable for
             the Linux host we were developing on. See https://forum.sparkfun.com/viewtopic.php?f=32&t=45071
             Also, after downloading a sketch in the nRF52832, the program does not start executing cleanly:
             you have to reset the processor again by pressing the reset button.
             This appears to be a problem with nrfutil, rather than a bug in RadioHead.
\version 1.66 2017-01-15
             Fixed some errors in (unused) register definitions in RH_RF95.h.<br>
             Fixed a problem that caused compilation errors in RH_NRF51 if the appropriate board
             support was not installed.
\version 1.67 2017-01-24
             Added RH_RF95::frequencyError() to return the estimated centre frequency offset in Hz
             of the last received message
\version 1.68 2017-01-25
             Fixed arithmetic error in RH_RF95::frequencyError() for some platforms.
\version 1.69 2017-02-02
             Added RH_RF95::lastSNR() and improved lastRssi() calculations per the manual.
\version 1.70 2017-02-03
             Added link to Binpress commercial license purchasing.
\version 1.71 2017-02-07
             Improved support for STM32. Patch from Bent Guldbjerg Christensen.
\version 1.72 2017-03-02
             In RH_RF24, fixed a problem where some important properties were not set by the ModemConfig.
             Added properties 2007, 2008, 2009. Also properties 200a was not being set in the chip.
             Reported by Shannon Bailey and Alan Adamson.
             Fixed corresponding convert.pl and added it to the distribution.
\version 1.73 2017-03-04
             Significant changes to RH_RF24 and its API. It is no longer possible to change the modulation scheme
             programatically: it proved impossible to cater for all the possible crystal frequencies,
             base frequency and modulation schemes. Instead you can use one of a small set of supplied radio
             configuration header files, or generate your own with Silicon Labs WDS application. Changing
             modulation scheme required editing RH_RF24.cpp to specify the appropriate header and recompiling.
             convert.pl is now redundant and removed from the distribution.
\version 1.74 2017-03-08
             Changed RHReliableDatagram so it would not ACK messages heard addressed to other nodes
             in promiscuous mode.<br>
             Added RH_RF24::deviceType() to return the integer value of the connected device.<br>
             Added documentation about how to connect RFM69 to an ESP8266. Tested OK.<br>
             RH_RF24 was not correctly changing state in sleep() and setModeIdle().<br>
             Added example rf24_lowpower_client.pde showing how to put an arduino and radio into a low power
             mode between transmissions to save battery power.<br>
             Improvements to RH_RF69::setTxPower so it now takes an optional ishighpowermodule
             flag to indicate if the connected module is a high power RFM69HW, and so set the power level
             correctly. Based on code contributed by bob.
\version 1.75 2017-06-22
             Fixed broken compiler issues with RH_RF95::frequencyError() reported by Steve Rogerson.<br>
             Testing with the very excellent Rocket Scream boards equipped with RF95 TCXO modules. The
             temperature controlled oscillator stabilises the chip enough to be able to use even the slowest
             protocol Bw125Cr48Sf4096. Caution, the TCXO model radios are not low power when in sleep (consuming
             about ~600 uA, reported by Phang Moh Lim).<br>
             Added support for EBYTE E32-TTL-1W and family serial radio transceivers. These RF95 LoRa based radios
             can deliver reliable messages at up to 7km measured.
\version 1.76 2017-06-23
             Fixed a problem with RH_RF95 hanging on transmit under some mysterious circumstances.
             Reported by several people at  https://forum.pjrc.com/threads/41878-Probable-race-condition-in-Radiohead-library?p=146601#post146601 <br>
             Increased the size of rssi variables to 16 bits to permit RSSI less than -128 as reported by RF95.
\version 1.77 2017-06-25
             Fixed a compilation error with lastRssi().<br>
\version 1.78 2017-07-19
             Fixed a number of unused variable warnings from g++.<br>
             Added new module RHEncryptedDriver and examples, contributed by Philippe Rochat, which
             adds encryption and decryption to any RadioHead transport driver, using any encryption cipher
             supported by ArduinoLibs Cryptographic Library http://rweather.github.io/arduinolibs/crypto.html
             Includes several examples.<br>
\version 1.79 2017-07-25
             Added documentation about 'Passing Sensor Data Between RadioHead nodes'.<br>
             Changes to RH_CC110 driver to calculate RSSI in dBm, based on a patch from Jurie Pieterse.<br>
             Added missing passthroughmethoids to RHEncryptedDriver, allowing it to be used with RHDatagram,
             RHReliableDatagram etc. Tested with RH_Serial. Added examples
\version 1.80 2017-10-04
             Testing with the very fine Talk2 Whisper Node LoRa boards https://wisen.com.au/store/products/whisper-node-lora
             an Arduino compatible board, which include an on-board RFM95/96 LoRa Radio (Semtech SX1276), external antenna,
             run on 2xAAA batteries and support low power operations. RF95 examples work without modification.
             Use Arduino Board Manager to install the Talk2 code support. Upload the code with an FTDI adapter set to 5V.<br>
             Added support for SPI transactions in development environments that support it with SPI_HAS_TRANSACTION.
             Tested on ESP32 with RFM-22 and Teensy 3.1 with RF69
             Added support for ESP32, tested with RFM-22 connected by SPI.<br>
\version 1.81 2017-11-15
             RH_CC110, moved setPaTable() from protected to public.<br>
             RH_RF95 modem config Bw125Cr48Sf4096 altered to enable slow daat rate in register 26
             as suggested by Dieter Kneffel.
             Added support for nRF52 compatible Arm chips such as as Adafruit BLE Feather board
             https://www.adafruit.com/product/3406, with a patch from Mike Bell.<br>
             Fixed a problem where rev 1.80 broke Adafruit M0 LoRa support by declaring
             bitOrder variable always as a unsigned char. Reported by Guilherme Jardim.<br>
             In RH_RF95, all modes now have AGC enabled, as suggested by Dieter Kneffel.<br>
\version 1.82 2018-01-07
             Added guard code to RH_NRF24::waitPacketSent() so that if the transmit never completes for some
             reason, the code will eventually return with FALSE.
             Added the low-datarate-optimization bit to config for RH_RF95::Bw125Cr48Sf4096.
             Fix from Jurie Pieterse to ensure RH_CC110::sleep always enters sleep mode.
             Update ESP32 support to include ASK timers. RH_ASK module is now working on ESP32.
\version 1.83 2018-02-12
             Testing adafruit M0 Feather with E32. Updated RH_E32 documentation to show suggested connections
             and contructor initialisation.<br>
             Fixed a problem with RHEncryptedDriver that could cause a crash on some platforms when used
             with RHReliableDatagram. Reported by Joachim Baumann.<br>
	     Improvments to doxygen doc layout in RadioHead.h
\version 1.84 2018-05-07
             Compiles with Roger Clarkes Arduino_STM32 https://github.com/rogerclarkmelbourne/Arduino_STM32,
	     to support STM32F103C etc, and STM32 F4 Discovery etc.<br>
	     Tested STM32 F4 Discovery board with RH_RF22, RH_ASK and RH_Serial.

\version 1.85 2018-07-09
             RHGenericDriver methods changed to virtual, to allow overriding by RHEncrypredDriver:
	     lastRssi(), mode(), setMode(). Reported by Eyal Gal.<br>
	     Fixed a problem with compiling RH_E32 on some older IDEs, contributed by Philippe Rochat.<br>
	     Improvements to RH_RF95 to improve detection of bad packets, contributed by PiNi.<br>
	     Fixed an error in RHEncryptedDriver that caused incorrect message lengths for messages multiples of 16 bytes
	     when STRICT_CONTENT_LEN is defined.<br>
	     Fixed a bug in RHMesh which causes the creation of a route to the address which is the byte
	     behind the end of the route array. Reported by Pascal Gillès de Pélichy.<br>
\version 1.86 2018-08-28
             Update commercial licensing, remove binpress.
\version 1.87 2018-10-06
             RH_RF22 now resets all registers to default state before initialisation commences. Suggested by Wothke.<br>
	     Added RH_ENABLE_EXPLICIT_RETRY_DEDUP which improves the handling of duplicate detection especiually
	     in the case where a transmitter periodically wakes up and start tranmitting from the first sequence number.
	     Patch courtesy Justin Newitter. Thanks.
\version 1.88 2018-11-13
             Updated to support ATTiny using instructions in
             https://medium.com/jungletronics/attiny85-easy-flashing-through-arduino-b5f896c48189
	     Updated examples ask_transmitter and ask_receiver to compile cleanly on ATTiny.
	     Tested using ATTiny85 and Arduino 1.8.1. <br>
\version 1.89 2018-11-15
             Testing with ATTiny core from https://github.com/SpenceKonde/ATTinyCore and RH_ASK,
	     using example ask_transmitter. This resulted in 'Low Memory, instability may occur',
             and the resulting sketch would transmit only one packet. Suggest ATTiny users do not use this core, but use
	     the one from https://raw.githubusercontent.com/damellis/attiny/ide-1.6.x-boards-manager/package_damellis_attiny_index.json
	     as described in https://medium.com/jungletronics/attiny85-easy-flashing-through-arduino-b5f896c48189 <br>
	     Added support for RH_RF95::setSpreadingFactor(), RH_RF95::setSignalBandwidth(), RH_RF95::setLowDatarate() and
	     RH_RF95::setPayloadCRC(). Patch from Brian Norman. Thanks.<br>

