frank26080115/robots/Roach/libraries/nRF52RawRadio/RadioHead.h
\version 1.90 2019-05-21
             Fixed a block size error in RhEncryptedDriver for the case when
             using STRICT_CONTENT_LEN and sending messages of exactly _blockcipher.blockSize() bytes in length.
	     Reported and patched by Philippe Rochat.
             Patch from Samuel Archibald to prevent compile errors with RH_AAK.cpp fo ATSAMD51.
	     Fixed a probem in RH_RF69::setSyncWords that prevented setSyncWords(NULL, 0) correctly
	     disabling sync detection and generation. Reported by Federico Maggi.
	     RHHardwareSPI::usingInterrupt() was a noop. Fixed to call SPI.usingInterrupt(interrupt);.

\version 1.91 2019-06-01
             Fixed a problem with new RHHardwareSPI::usingInterrupt() that prevented compilation on ESP8266
	     which does not have that call.

\version 1.92 2019-07-14
             Retested serial_reliable_datagram_client.pde and serial_reliable_datagram_server.pde built on Linux
	     as described in their headers, and with USB-RS485 adapters. No changes, working correctly.
	     Testing of nRF5232 with Sparkfun nRF52 board support 0.2.3 shows that there appears to be a problem with
	     interrupt handlers on this board, and none of the interrupt based radio drivers can be expected to work
	     with this chip.
	     Ensured all interrupt routines are flagged with ICACHE_RAM_ATTR when compiled for ESP8266, to prevent crashes.

\version 1.94 2019-09-02
             Fixed a bug in RHSoftwareSPI where RHGenericSPI::setBitOrder() has no effect for
	     on RHSoftwareSPI. Reported by Peter.<br>
	     Added support in RHRouter for a node to optionally be leaf node, and not participate as a router in the
	     network. See RHRouter::setNodeTypePatch from Alex Evans.<br>
	     Fixed a problem with ESP32 causing compile errors over missing SPI.usingInterrupt().<br>

\version 1.95 2019-10-14
             Fixed some typos in RH_RF05.h macro definitions reported by Clayton Smith.<br>
	     Patch from Michael Cain from RH_ASK on ESP32, untested by me.<br>
	     Added support for RPi Zero and Zero W for the RF95, contributed by Brody Mahoney.
	     Not tested by me.<br>

\version 1.96 2019-10-14
             Added examples for RPi Zero and Zero W to examples/raspi/rf95, contributed by Brody Mahoney
	     not tested by me. <br>

\version 1.97 2019-11-02
             Added support for Mongoose OS, contributed by Paul Austen.

\version 1.98 2020-01-06
             Rationalised use of RH_PLATFORM_ATTINY to be consistent with other platforms.<br>
	     Added support for RH_PLATFORM_ATTINY_MEGA, for use with Spencer Konde's megaTinyCore
	     https://github.com/SpenceKonde/megaTinyCore on Atmel megaAVR ATtiny 1-series chips.
	     Tested with AtTiny 3217, 3216 and 1614, using
	     RH_Serial, RH_ASK, and RH_RF22 drivers.<br>

\version 1.99 2020-03-07
              Release under GPL V3

\version 1.100 2020-03-12
             Fixed a problem that prevented compilation of RH_NRF51
	     on Arduino for Sparkfun nRF52832 Breakout board.<br>

\version 1.101 2020-04-10
	     Tested nRF52832 with RFM69W module and RH_RF69, using Software SPI and hardware interrutps OK.<br>
	     Fixed warnings about 'deleting object of polymorphic class' if driver is dynamically allocated.<br>
	     Fixed problems in RH_ASK and HardwareSPI to work with STM32F4 Discovery with latest
	     version of stm32duino https://github.com/stm32duino/Arduino_Core_STM32.
	     Testing with stm32duino 1.8.0 downloaded with Board Manager per
	     https://github.com/stm32duino/Arduino_Core_STM32 .
	     Now builds and run RH_ASK examples with STM32F4 Discovery board.
	     Build without error for STM32 F1 and F4 but Does not compile for Generic STM32F3.

\version 1.102 2020-05-15
             Updated RH_RF95::setPayloadCRC to affect CRC generation on outgoing packets as well
	     as CRC detection and checking on incoming packets.
	     Added new modem config for RH_RF95. RH_RF95::Bw125Cr45Sf2048
	     Bw = 125 kHz, Cr = 4/5, Sf = 2048chips/symbol, CRC on. Slow+long range. Tested
	     against RPI with LoRa-file-ops driver https://github.com/starnight/LoRa/tree/file-ops
	     and send.c test program.
	     Fixed a problem with (re-)definition of SS on ESP32, reported and fixed by Justin Newitter.

\version 1.103 2020-05-30
             Fixed some errors in RH_RF95::setTxPower which cased the power levels to be set incorrectly.
	     Checked operation and improved documentation. Valid settings are:
	     2 to 20 (useRFO false) and 0 to 15 (useRFO true). 18, 19 and 20 (useRFO false) turn on the PA_DAC.
	     Fixed RF95 examples to reflect correct use.
	     Added RH_ABZ driver, which supports the muRata CMWX1ZZABZ (TypeABZ) module
	     which includes an STM32L0 processor, a SX1276 LoRa radio and an antenna switch.
	     Requires the Grumpy Old Pizza Arduino Core installed per https://github.com/GrumpyOldPizza/ArduinoCore-stm32l0
	     Examples provided.

\version 1.104 2020-06-08
             Fixed a problem with new RH_ABZ module that prevents compilation with standard 0.0.10 version of STM32L0 <br>
	     Arduino Core installed with Board Manager: STM32L0_EXTI_CONTROL_PRIORITY_CRITICAL
	     is only available in later versions.<br>

\version 1.105 2020-06-03
             Added support for RH_ABZ on STM32L072xx on Grumpy Old Pizza Arduino Core<br>

\version 1.106 2020-06-16
             Patch from	Livio Tenze for RH_RF22 to fix a problem with interrupts on on ESP8266.<br>
	     Added examples/rf22/rf22_cw, with example showing how to emit a carrier wave (CW).<br>
	     Reverted delay in RHSPIDriver::init() back to 100ms for all platforms except ABZ, where
	     100ms interferes with the USB serial port with at least some versions of the core.<br>
	     Updated and clarified documentation about TCXO use in RH_ABZ and examples.<br>
	     Fixed documentation SS->NSEL pin for RH_RF22 with AtMega. Seems that SS on that platform
	     is now defined as pin 10, not 53. Dont know when that changed.<br>

\version 1.107 2020-06-26
             Improvements to RHEncryptedDriver, so that you will get an explanatory error message if you
	     include RHEncryptedDriver.h without enabling the class with RH_ENABLE_ENCRYPTION_MODULE in RadioHead.h.<br>
	     Fixed newly introduced errors when compiling for ATTiny 25/45/85.<br>

\version 1.108 2020-07-05
             Fixed a problem with RH_RF22 on ESP8266 introcuced in version 1.106 which prevented
	     messages being received. Some other cleanups in RH_RF22<br>

\version 1.109 2020-07-23
             Fixed a problem that prevented RHEncryptedDriver compiling when RH_ENCRYPTED_DRIVER was enabled.<br>
	     Added optiona hops argument to RHRouter and RHMesh recvfromAck() and receivedFomAckTimeout()
	     to allow the hop count to be retreived if desired.
\version 1.110 2020-07-28
	     Fixed a problem where _spi.beginTransaction and _spi.endTransaction were missing from RHSPIDriver::spiRead.
\version 1.111 2020-07-30
             Fixed some compilation problems on some platforms with RH_PLATFORM_ATTINY_MEGA and Kondes MegaTinyCore 1.1.2.<br>
	     Fixed some other errors with  Kondes MegaTinyCore 2.0.5: F_CPU_CORRECTED no longer exists,
	     bitOrder and PinStatus no longer needed.<br>
	     Improved detection of RH_PLATFORM_ATTINY_MEGA by looking for defined(MEGATINYCORE), defined
	     in later versions of MegaTinyCore.

\version 1.112 2020-08-05
             Fixed some compiler warnings in STM32 Discovery and other processors.<br>
	     Added support for ST's Arduino Core STM32, https://github.com/stm32duino/Arduino_Core_STM32
	     to RH_ASK, per https://github.com/r-map/rmap/commit/edf9931b21cb7df5b4f67835307255e0fcb301bb.<br>
	     Added documentation about requirements for code contributions.<br>
	     Added library.properties file that some IDEs need.<br>
	     Added support for multithreaded RH_RF95 support on Raspberry Pi, courtesy Tilman Glötzner.<br>
	     Includes example programs, including for the Dragino Lora/GPS Hat which
	     send GPS coordinates.<br>

