frank26080115/robots/Roach/libraries/nRF52RawRadio/RadioHead.h
\version 1.113 2020-10-15
             Changes to RH_ASK on SpenceKonde's megaTinyCore so it will use TCB0 on platforms
	     where TCB1 is not available.<br>
	     Minor imprvements to documentation.<br>
	     Move to local git for source code control.<br>
	     Added support for RH_ABZ::deinit() for Matt Way.
	     Fixed compilation error in RH_ASK caused by changes to interrupt API in Arduino_Core_STM32 1.9

\version 1.114 2021-03-24
             Fixed compile warnings, errors on some platforms, in RH_ASK.cpp for STM32 core 1.9.0
	     to do with odd behaviour of callback_function_t.<br>
	     Fixed some problems with SPI transactions in RH_RF69 and RH_RF24 that affected
	     operations with STM32F030F4. Reported and patched by Adam De Muri.<br>
	     Added tools/createGPX.pl, contributed by Tilman Glötzner: A perl script to process the dump files that can be
	     produced with the  Dragino LoRa-GPS-hat and rf95_client2 + rf95_server2.
	     The programs exchange sequence numbers, timestamps and gps coordinates
	     via Lora which can be used for range measurements or visualization. The
	     perl script is meant for post processing and  converts the log files
	     into Gpx-files which in turn can be imported to google maps.<br>
	     Added support for MRF89XAM8A, which has support for different frequency bands to RH_MRF89. Patch courtesy
	     Michael Kefeder.

\version 1.115 2021-03-24
             Fix compile error in new MRF89XAM8A support.

\version 1.116 2021-03-30
             Patch from Vlasta Hajek: 1.  Made RH_ASK usable again for ATTINY after breaking changes.
	     2. Added the possibility to use Timer 1 on ATtiny8x. Tested on ATtiny 85
	     and ATtiny84 for more than a year.
	     3. Added patch for ESP32 from jPerotto. This finally makes receiving via
	     RH_ASK on ESP32 without panics. Tested for more than 6 months.<br>

\version 1.117 2021-05-26
             Added documention to RH_MRF89 about how to achieve 1μA power consumption in sleep mode.
	     Courtesy Fernando Faria.<br>
	     Improved documentation for the meaning of 'len' in all recv*, as suggested by Sean. E. Sean.<br>
	     waitAvailable and waitAvaiableTimeout now take an optional polldelay argument that
	     can be useful for introducing on multitasking systems where a driver requires polling.<br>
	     Fixed compile errors with forward declarations in RH_E32.h and RH_Serial.h on Ardiono IDE on Windows
	     reported by Skywodd.

\version 1.118 2021-07-16
             Added a 1 us delay in RHSPIDriver::spiWrite as recommended in
	     https://forum.pjrc.com/attachment.php?attachmentid=10948&d=1499109224
	     for corect operation with some fast processors. <br>
	     Tested Ebyte E22-900T22S radios with serial interface and the examples from
	     examples/serial/serial_reliable_datagram_* on Linux.
	     These radios implement a transparent serial connection
	     using LORA. They can also be configured as independent relays.
	     You can alter the default configuration of the radios (including frequency,
	     transmission rates, node addresses etc) by using the
	     Ebyte RF Settings for E22 tool from https://www.cdebyte.net/download-tools and after
	     setting the device to configuraiotn mode (M1 high: temporarily remove the M1 link).
	     Caution, to use this
	     tool on Windows, you also must install the CH340 USB-Serial port driver, see
	     https://learn.sparkfun.com/tutorials/how-to-install-ch340-drivers/all#windows-710
	     These modules can also be configured programatically, but this is not supported by RadioHead. <br>
	     Fixed compile errors to do with RH_DRAM_ATTR on non-ESP-32 platforms. <br>
	     Fixed problems reported with crashes in RH_ASK on STM32 boards with core >= 1.9.0 due to
	     incorrect declaration of interrupt function.  <br>

\version 1.119 2021-08-02
             Changes to RadioHead.h RHHardwareSPI.cpp and RHSPIDriver.cpp for ESP32 support
	     provided by Juliano Perotto.

\version 1.120 2021-11-13
             Added intial support for Raspberry Pi Pico, using the Raspberry Pi Pico/RP2040 core by Earle F. Philhower, version 1.93,
	     installed per https://arduino-pico.readthedocs.io/_/downloads/en/latest/pdf/
	     RH_ASK works with default pins (11 and 12). But it seems that interrupt callbacks (needed by most SPI based
	     radio drivers in RadioHead) are not working (yet) in this core, at least when compiled on our Linux platform.
	     It appears
	     there is some bug in std::map that causes the interrupt handling to not work correctly
	     (which I have been able to reproduce in a simple sketch that only uses std::map). This is very strange.
	     Interrupts _are_ supported and work in the alternative Arduino MBED OS RP2040 core version 2.4.1,
	     but there are other mysterious crashes RadioHead when a radio driver reads SPI inside an interrupt.
	     But RH_ASK also works with this core.
	     So the result (so far) is partial support of RadioHead using either core (so far).
	     We will revisit this when either core is updated<br>
	     On ESP32, added support for using the non-default HSPI bus by defining RH_ESP32_USE_HSPI.<br>
	     Improved the reading of RSSI for the last packet in RH_CC110: seems that it was being read too soon. Now
	     read it from the end received packet with RH_CC110_APPEND_STATUS.<br>
             Added RH_LoRaFileOps, driver on RPi+Linux and using LoRa-file-ops Linux driver ioctls to
	     transmit and receive RadioHead compatible messages via SX1276/77/78/79
	     and compatible radios. Requires a modified version of LoRa-file-ops driver to be installed,
	     and a compatible radio to be connected appropriately:
	     https://github.com/starnight/LoRa/tree/file-ops <br>

\version 1.121 2022-02-02
             Restored RH_RF95 code to clear the IRQ flags (twice).


\author  Mike McCauley. DO NOT CONTACT THE AUTHOR DIRECTLY. USE THE GOOGLE GROUP GIVEN ABOVE
*/

/*! \page packingdata
\par Passing Sensor Data Between RadioHead nodes

People often ask about how to send data (such as numbers, sensor
readings etc) from one RadioHead node to another. Although this issue
is not specific to RadioHead, and more properly lies in the area of
programming for networks, we will try to give some guidance here.

