frank26080115/robots/Roach/libraries/nRF52RawRadio/RadioHead.h
// Sigh: there is no widespread adoption of htons and friends in the base code, only in some WiFi headers etc
// that have a lot of excess baggage
#if RH_PLATFORM != RH_PLATFORM_UNIX && !defined(htons)
// #ifndef htons
// These predefined macros available on modern GCC compilers
 #if   __BYTE_ORDER__ == __ORDER_LITTLE_ENDIAN__
  // Atmel processors
  #define htons(x) ( ((x)<<8) | (((x)>>8)&0xFF) )
  #define ntohs(x) htons(x)
  #define htonl(x) ( ((x)<<24 & 0xFF000000UL) | \
                   ((x)<< 8 & 0x00FF0000UL) | \
                   ((x)>> 8 & 0x0000FF00UL) | \
                   ((x)>>24 & 0x000000FFUL) )
  #define ntohl(x) htonl(x)

 #elif __BYTE_ORDER__ == __ORDER_BIG_ENDIAN__
  // Others
  #define htons(x) (x)
  #define ntohs(x) (x)
  #define htonl(x) (x)
  #define ntohl(x) (x)

 #else
  #error "RadioHead.h: Dont know how to define htons and friends for this processor"
 #endif
#endif

// Some platforms need a mutex for multihreaded case
#ifdef RH_USE_MUTEX
 #include <pthread.h>
 #define RH_DECLARE_MUTEX(X) pthread_mutex_t X;
 #define RH_MUTEX_INIT(X) pthread_mutex_init(&X, NULL)
 #define RH_MUTEX_LOCK(X) pthread_mutex_lock(&X)
 #define RH_MUTEX_UNLOCK(X) pthread_mutex_unlock(&X)
#else
 #define RH_DECLARE_MUTEX(X)
 #define RH_MUTEX_INIT(X)
 #define RH_MUTEX_LOCK(X)
 #define RH_MUTEX_UNLOCK(X)
#endif

// This is the address that indicates a broadcast
#define RH_BROADCAST_ADDRESS 0xff

// Specifies an invalid IO pin selection
#define RH_INVALID_PIN       0xff

// Uncomment this is to enable Encryption (see RHEncryptedDriver):
// But ensure you have installed the Crypto directory from arduinolibs first:
// http://rweather.github.io/arduinolibs/index.html
//#define RH_ENABLE_ENCRYPTION_MODULE

// Some platforms like RocketScream need this to see debug Serial output from within RH
// and if it goes to Serial, get a hang after a few minutes.
//#define Serial SerialUSB

#endif
